<!-- -*- mode: markdown; coding: utf-8; fill-column: 60; ispell-dictionary: "english" -*- -->

<meta charset="utf-8"/>
<meta name="viewport" content="width=device-width,initial-scale=1"/>
<link rel="stylesheet" href="style.css">


# EDAF75 - lab 2: Testing the database

As usual we have to tell Jupyter to allow SQL:

In [1]:
%load_ext sql

There's a new jupysql version available (0.10.9), you're running 0.10.8. To upgrade: pip install jupysql --upgrade

Loading configurations from /home/hugo/Documents/skola/edaf75/repo/pyproject.toml.

Settings changed:

+------------+-------+
|   Config   | value |
+------------+-------+
|  feedback  |  True |
| autopandas |  True |
+------------+-------+

And then we import our movie database

In [10]:
%sql sqlite:///movies.sqlite

We want to make sure that SQLite3 really checks our foreign
key constraints -- to do that, we run:

In [3]:
%%sql
PRAGMA foreign_keys=ON;

Running query in 'sqlite:///movies.sqlite'

Empty DataFrame
Columns: []
Index: []

Now write SQL code for the following tasks:


+ Show the names of all movies.

In [5]:
%%sql
select   title
from     movies

Running query in 'sqlite:///movies.sqlite'

          title
0  Forrest Gump
1     Mamma Mia

+ Show the performance dates for one of the movies.

In [15]:
%%sql
select  date
from    performances
where   imdb = 'abc'

Running query in 'sqlite:///movies.sqlite'

         date
0  2024-02-05
1  2024-02-05
2  2024-03-06

+ Show all data concerning performances at a given theatere
  on a given date.

In [14]:
%%sql
select   *
from     performances
where    theater_name = 'Kino' and date = '2024-02-05'

Running query in 'sqlite:///movies.sqlite'

                     performance_id start_time        date theater_name imdb
0  730b05ab53ef59e3780b760d7b6fac05      20:00  2024-02-05         Kino  abc
1  c8f24afb0da84496151a7d17949d6d62      23:00  2024-02-05         Kino  def

+ List all customers

In [16]:
%%sql
select   *
from     customers

Running query in 'sqlite:///movies.sqlite'

      user_name         full_name password
0  mugohattsson     Hugo Mattsson    12345
1          empa  Emelie Bondesson     9876

+ List all tickets

In [36]:
%%sql
select *
from   tickets

Running query in 'sqlite:///movies.sqlite'

,ticket_id,user_name,performance_id
0,31a902dc40c0f5da0eef921eca6da06e,mugohattsson,ab37028c279f402903d35498ecbceb69
1,c8d8495576cee93d70e04d54ac0cf490,mugohattsson,ab37028c279f402903d35498ecbceb69

+ Create a new ticket to some performance (i.e., insert a
  new row in your table of tickets).

In [32]:
%%sql
select   *
from     performances
         join movies using(imdb)
where    title = 'Mamma Mia'
order by date, start_time

Running query in 'sqlite:///movies.sqlite'

,performance_id,start_time,date,theater_name,imdb,title,year,run_time
0,ab37028c279f402903d35498ecbceb69,20:00,2024-02-05,Filmstaden Lund,def,Mamma Mia,2010,135
1,c8f24afb0da84496151a7d17949d6d62,23:00,2024-02-05,Kino,def,Mamma Mia,2010,135
2,6f67c718bee9011ff36a4dbbbf5923be,13:00,2024-03-06,Kino,def,Mamma Mia,2010,135
3,5f03ca8e813e9e0de48b5a786c9e45a0,15:00,2024-04-08,Filmstaden Lund,def,Mamma Mia,2010,135
4,7d283cd661d8d4015224d159b05ed83a,19:00,2024-04-08,Filmstaden Lund,def,Mamma Mia,2010,135

In [33]:
%%sql
insert
into    tickets(performance_id, user_name)
values  ('ab37028c279f402903d35498ecbceb69', 'mugohattsson')

Running query in 'sqlite:///movies.sqlite'

1 rows affected.

Empty DataFrame
Columns: []
Index: []

In newer versions of SQLite (since version 3.35, released
  in March 2021), and in
  [PostgreSQL](https://www.postgresql.org/docs/current/sql-insert.html),
  we can get any value generated during an insert using the
  `INSERT...-RETURNING` statement:

~~~{.sql}
INSERT
INTO       students
VALUES     ('Amy', 3.9, 1200)
RETURNING  s_id
~~~

which would return the generated `s_id` for the new
  student.

  If your SQLite version is older than 3.35, and you can't
  upgrade, you can instead use the following idea: each row
  in a SQLite3 table has a `rowid` attribute, it is a unique
  integer which essentially tells in which order the rows
  were inserted, and it's not displayed in queries unless we
  ask for it. SQLite3 also have a function,
  `last_insert_rowid()`, which returns the `rowid` of the
  last inserted row of a table, so we can see the `s_id` of
  the most recently inserted student with the following
  query:

~~~{.sql}
SELECT s_id
FROM   students
WHERE  rowid = last_insert_rowid();
~~~

Now, check what ticket number we got for the ticket we
  created above (it should be the same as the ticket id,
  which should be a `randomblob`):

In [35]:
%%sql
insert
into    tickets(performance_id, user_name)
values  ('ab37028c279f402903d35498ecbceb69', 'mugohattsson')
returning ticket_id

Running query in 'sqlite:///movies.sqlite'

                          ticket_id
0  c8d8495576cee93d70e04d54ac0cf490

+ Try to insert two movie theaters with the same name (this
  should fail).

In [38]:
%%sql
insert
into    theaters(theater_name, capacity)
values  ('Kino', 400);

Running query in 'sqlite:///movies.sqlite'

RuntimeError: (sqlite3.IntegrityError) UNIQUE constraint failed: theaters.theater_name
[SQL: insert
into    theaters(theater_name, capacity)
values  ('Kino', 400);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)
If you need help solving this issue, send us a message: https://ploomber.io/community

+ Try to insert a performance where the theater doesn’t
  exist in the database (this should fail).

In [40]:
%%sql
insert
into    performances(start_time, date, theater_name, imdb)
values  ('09:00', 'Bio Metropol', '2024-03-16', 'abc')

Running query in 'sqlite:///movies.sqlite'

RuntimeError: (sqlite3.IntegrityError) FOREIGN KEY constraint failed
[SQL: insert
into    performances(start_time, date, theater_name, imdb)
values  ('09:00', 'Bio Metropol', '2024-03-16', 'abc')]
(Background on this error at: https://sqlalche.me/e/20/gkpj)
If you need help solving this issue, send us a message: https://ploomber.io/community

+ Create a ticket where either the user or the performance
  doesn’t exist (this should fail).

In [41]:
%%sql
insert
into    tickets(performance_id, user_name)
values  ('hejsansvejsan', 'mugohattsson')

Running query in 'sqlite:///movies.sqlite'

RuntimeError: (sqlite3.IntegrityError) FOREIGN KEY constraint failed
[SQL: insert
into    tickets(performance_id, user_name)
values  ('hejsansvejsan', 'mugohattsson')]
(Background on this error at: https://sqlalche.me/e/20/gkpj)
If you need help solving this issue, send us a message: https://ploomber.io/community